In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

### apply

In [4]:
df['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [5]:
def trans_who(x):
    if x == 'man':
        return '남자'
    elif x == 'woman':
        return '여자'
    else:
        return '아이'

In [7]:
df['who'].apply(trans_who)
# 재할당 필요

0      남자
1      여자
2      여자
3      여자
4      남자
       ..
886    남자
887    여자
888    여자
889    남자
890    남자
Name: who, Length: 891, dtype: object

In [9]:
# x는 행
def fare_age(x):
    return x['fare'] / x['age']

In [12]:
type(df.apply(fare_age, axis=1))

pandas.core.series.Series

In [14]:
df['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [17]:
df['survived'].apply(lambda x: '생존' if x== 1 else '사망')

0      사망
1      생존
2      생존
3      생존
4      사망
       ..
886    사망
887    생존
888    사망
889    생존
890    사망
Name: survived, Length: 891, dtype: object

## groupby
묶어서 따로보기

In [19]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
df.groupby('sex').mean(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

In [24]:
df.groupby(['sex', 'pclass'])['survived'].mean(numeric_only=True)

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
Name: survived, dtype: float64

In [30]:
# 데이터 프레임 형태 유지를 위해
[[]   ]
pd.DataFrame(df.groupby(['sex', 'pclass'])['survived'].mean(numeric_only=True))
df.groupby(['sex', 'pclass'])[['survived']].mean(numeric_only=True)

               survived
sex    pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

# 인덱스 초기화
## reset_index

In [28]:
df.groupby(['sex', 'pclass'])['survived'].mean().reset_index()

      sex  pclass  survived
0  female       1  0.968085
1  female       2  0.921053
2  female       3  0.500000
3    male       1  0.368852
4    male       2  0.157407
5    male       3  0.135447

In [32]:
df.groupby(['sex', 'pclass'])[['survived', 'age']].agg(['mean','sum'])

               survived            age
                   mean sum       mean      sum
sex    pclass
female 1       0.968085  91  34.611765  2942.00
       2       0.921053  70  28.722973  2125.50
       3       0.500000  72  21.750000  2218.50
male   1       0.368852  45  41.281386  4169.42
       2       0.157407  17  30.740707  3043.33
       3       0.135447  47  26.507589  6706.42

## pivot_table

In [37]:
df.pivot_table(index='who', values='survived')

       survived
who
child  0.590361
man    0.163873
woman  0.756458

In [35]:
df.pivot_table(columns='who', values='survived')

who          child       man     woman
survived  0.590361  0.163873  0.756458

In [40]:
df.pivot_table(index=['who', 'pclass'] , values='survived', aggfunc=['sum', 'mean'])

                  sum      mean
             survived  survived
who   pclass
child 1             5  0.833333
      2            19  1.000000
      3            25  0.431034
man   1            42  0.352941
      2             8  0.080808
      3            38  0.119122
woman 1            89  0.978022
      2            60  0.909091
      3            56  0.491228